[
  "The login page keeps crashing on mobile. Very frustrating! I've tried multiple times today.",
  "Love the product but wish it had dark mode. My eyes hurt at night.",
  "Support team was super helpful, resolved my issue in 5 minutes! Great job Sarah!",
  "Can't export my data to CSV. This is a dealbreaker for our team.",
  "The new dashboard is confusing. Bring back the old layout please.",
  "App crashes every time I try to upload a file larger than 10MB. Need this fixed ASAP!",
  "Finally, a product that actually works as advertised. Thank you!",
  "Why is there no keyboard shortcut for saving? It's 2026, come on.",
  "The onboarding process was smooth and intuitive. Great first impression!",
  "Payment failed three times. Had to use a different card. Very frustrating experience.",
  "Would love to see integration with Slack. We use it daily.",
  "Your mobile app is a joke. Completely unusable on Android.",
  "The search function is blazing fast. Impressed with the performance!",
  "Error 500 every time I try to access my reports. This is critical for my business.",
  "Please add two-factor authentication. Security is important to us.",
  "Best customer service I've experienced in years. John went above and beyond!",
  "The pricing page is misleading. Hidden fees appeared at checkout.",
  "Can you add bulk import from Excel? Would save us hours every week.",
  "Notifications are not working on iOS. Haven't received any for 3 days.",
  "The UI redesign is beautiful! Love the new color scheme.",
  "Data sync between devices is broken. Changes on desktop don't appear on mobile.",
  "We need custom branding options. White-label would be amazing.",
  "Loading times have gotten worse with the latest update. Please optimize.",
  "The tutorial videos are excellent. Learned everything in under an hour.",
  "Calendar integration with Google Calendar is a must-have for us.",
  "App keeps logging me out randomly. Very annoying.",
  "The analytics dashboard is exactly what we needed. Great insights!",
  "PDF export is broken. All I get is a blank page.",
  "Please add recurring task functionality. It's a basic feature.",
  "Your API documentation is top-notch. Easy to integrate.",
  "The forgot password email never arrives. Had to contact support.",
  "Team collaboration features are game-changing. Best investment we've made!",
  "Why can't I customize the email templates? Very limited.",
  "The drag-and-drop interface is intuitive and fun to use.",
  "Server downtime during business hours is unacceptable. Lost a client today.",
  "Would be great to have offline mode for when traveling.",
  "The free tier is too limited. Can't even try the basic features properly.",
  "Excellent value for money. Switched from a competitor and never looked back.",
  "The image compression is too aggressive. My photos look terrible.",
  "Please add support for multiple languages. We have international clients.",
  "Checkout process is too long. 7 steps is ridiculous.",
  "The real-time collaboration feature works flawlessly. No lag at all!",
  "Can't delete my account. Where is this option?",
  "Your chatbot is useless. Couldn't understand a single question.",
  "The mobile app update finally fixed the battery drain issue. Thank you!",
  "Need better sorting and filtering options in the dashboard.",
  "The webinar training sessions are incredibly helpful. More please!",
  "Form submission randomly fails. No error message, just nothing happens.",
  "Please add a dark theme. The bright white is hurting my eyes at night.",
  "Integration with Zapier would open up so many possibilities for automation.",
  "The response time from support has improved dramatically. Keep it up!",
  "Video playback is choppy and keeps buffering. Unwatchable.",
  "Would love to see a desktop app. Browser tabs get lost too easily.",
  "The tagging system is powerful. Finally organized my entire workflow!",
  "SSO login with Okta is broken. Half our team can't access the platform.",
  "Please add version history for documents. Just lost hours of work.",
  "Your product has transformed how our team communicates. 10/10!",
  "The contrast on buttons is too low. Accessibility issue for sure.",
  "Can we get custom fields? The default ones don't fit our needs.",
  "Print layout is completely messed up. Pages overlap.",
  "The new feature announcements in-app are non-intrusive. Nice touch!",
  "API rate limits are too restrictive for our use case.",
  "Finally a company that listens to customer feedback. Thank you!",
  "The attachment size limit of 5MB is too small. Need at least 25MB.",
  "Would be helpful to have a quick view or preview panel.",
  "Password requirements are reasonable. Not too strict, not too weak.",
  "Data export takes forever. 10 minutes for a small file?",
  "The community forum is a great resource. Found answers to all my questions.",
  "Push notifications are delayed by 30+ minutes. What's the point?",
  "Please add the ability to schedule posts in advance.",
  "The interface lag when switching tabs is really annoying.",
  "Customer success team proactively reached out. Felt valued!",
  "Copy-paste formatting is broken. Everything becomes plain text.",
  "Need more chart types for data visualization. Pie charts aren't enough.",
  "The smart suggestions feature saves me so much time!",
  "My data disappeared after the update. Please restore it!",
  "Would love a browser extension for quick access.",
  "The quarterly product updates show you're committed to improvement.",
  "Invoice generation is clunky. Takes 10 clicks for a simple task.",
  "Support for markdown in notes would be fantastic.",
  "The status page during outages is very informative. Transparency appreciated!",
  "Auto-save keeps overwriting my changes with old data.",
  "Please consider a lifetime license option.",
  "The new AI-powered search is incredible. Finds exactly what I need!",
  "Links in emails open in the wrong browser.",
  "Need better permission controls for team members.",
  "Your blog content is educational and not salesy. Refreshing!",
  "The trial period is too short. Need more time to evaluate.",
  "Audio quality in video calls is crystal clear.",
  "Bulk actions would save us hours. Select all, delete all, etc.",
  "The progress tracking feature keeps our team accountable.",
  "Can't resize columns in the table view. Basic functionality missing.",
  "Integration with QuickBooks would be a dream come true.",
  "The onboarding checklist helped me discover features I didn't know existed.",
  "Session timeout is way too short. Logs me out every 10 minutes.",
  "Please add commenting on specific items. Collaboration is difficult without it.",
  "The keyboard navigation is excellent. Haven't touched my mouse in hours!",
  "Webhook reliability is poor. About 20% of events never fire.",
  "Your Black Friday deal was amazing. Thanks for the discount!",
  "The date picker UI is confusing. Took me 5 minutes to figure it out.",
  "Would be great to have templates for common workflows.",
  "Referral program rewards are generous. Already referred 5 friends!",
  "The memory usage is out of control. Browser crashes frequently.",
  "Please fix the timezone handling. Meetings keep showing wrong times.",
  "The clean interface is a breath of fresh air. No clutter!",
  "Attachment download is painfully slow. Even for small files.",
  "Need the ability to archive old projects without deleting them.",
  "Your YouTube tutorials are better than most paid courses!",
  "The duplicates detection feature has cleaned up our database significantly.",
  "Can't undo a delete action. Just lost important data.",
  "Sub-folders would help organize things better.",
  "The performance on older devices is surprisingly good!",
  "Why do I need to re-enter my password for every small action?",
  "The comparison view makes reviewing changes so easy.",
  "Email deliverability is terrible. Most emails go to spam.",
  "Please add touch gestures for mobile. Swiping would be natural.",
  "The consistent design across platforms is impressive.",
  "Loading spinner gets stuck at 99%. Have to refresh every time.",
  "A visual workflow builder would make automation accessible.",
  "Your team's responses on Twitter are always helpful and friendly!",
  "The file organization system is too rigid. Need more flexibility.",
  "Being able to star or favorite items would be really useful.",
  "The data migration tool made switching from our old system painless.",
  "Connection timeouts happen too frequently during peak hours.",
  "Love the detail in the changelogs. Know exactly what's new!",
  "Would appreciate more granular notification settings.",
  "The inline editing feature is smooth and responsive.",
  "SSL certificate expired. Got security warnings all day.",
  "Multi-select for batch operations is desperately needed.",
  "The personalized dashboard recommendations are spot-on!",
  "Font size in the editor is too small. No option to change it.",
  "Plugin architecture would allow for unlimited customization.",
  "Your 99.9% uptime claim is accurate. Very reliable service!",
  "The import wizard fails silently on malformed data. No feedback.",
  "Collaborative editing in real-time would be a game-changer.",
  "The welcome email was warm and not too long. Perfect tone!",
  "Spell check is broken in Firefox. Works fine in Chrome.",
  "Please add support for custom date formats.",
  "The smooth animations make the app feel premium.",
  "Undo history is limited to only 3 steps. Need more!",
  "The AI assistant in the help section is surprisingly accurate.",
  "Bandwidth usage is excessive. Eating through my data plan.",
  "Would love conditional logic in forms.",
  "The monthly newsletter has great tips. Keep sending them!",
  "Cursor jumps to end of text randomly while typing.",
  "Better empty state designs would improve the new user experience.",
  "The sandbox environment for testing is incredibly useful!",
  "Image upload rotates my photos 90 degrees. Very annoying.",
  "Need read-only sharing for external stakeholders.",
  "The quick start guide got me up and running in 15 minutes!"
]
